README.org
#+TITLE: Konfigurering av Emacs
#+PROPERTY: 
#+STARTUP: overview num
* Kilder og forbilder
** Gode eksempler
*** [[http://doc.norang.ca/org-mode.html][Bernt Hansen sin emacs-konfigurering]]
Den første emacskonfigurasjonen jeg kopierte mer eller mindre alt av og testet den gang jeg var rimelig fersk. Og ennå så tror jeg store deler av org-mode konfigurasjonen min bygger på hans oppsett. Dette er en kar som har rimelig god kontroll over verktøyet Emacs. 

Sett bort fra det at hans arbeidsflyt ikke helt passer min - til det er den litt for regimentert - så er det at hav av gode eksempler her. Det var med denne jeg først lærte å bruke Emacs og org-mode for noen år siden. 
* Pakker
Konfigurasjon knyttet til moduler og pakker. 
** Generell konfigurering inkludert pakkearkiv
#+begin_src emacs-lisp :tangle "~/GitHub/emacs-config/pakker.el"
  (setq package-enable-at-startup nil)
  (package-initialize)
  (cond ((eq system-type 'windows-nt) (setq package-archives '(("elpa" . "https://elpa.gnu.org/packages/"))))
        ((eq system-type 'gnu/linux) (setq package-archives '(("elpa" . "https://elpa.gnu.org/packages/")
                                                            ("marmalade" . "https://marmalade-repo.org/packages/")
                                                            ("org" . "https://orgmode.org/elpa/")
                                                            ("melpa" . "https://melpa.org/packages/")
                                                            ))))
#+end_src

** [[https://github.com/jwiegley/use-package][Use-package]] 
Denne pakken er laget for det å samle konfigurasjon knyttet til en pakke, og på det viset legge opp til en ryddigere konfigurasjonfil, og man kan kontrollere lasting av pakker slik at man kan korte ned på oppstartstid for Emacs.
#+begin_src emacs-lisp :tangle "~/GitHub/emacs-config/pakker.el"
  (eval-when-compile
    (require 'use-package))

  (setq use-package-always-ensure t
        ;; use-package-always-ensure t
        use-package-verbose nil
        use-package-expand-minimally t
        use-package-enable-imenu-support t
      
        )
#+end_src
** Quelpa
Dette er en pakke som brukes for å bygge pakker fra lokal eller ekstern kilde. Quelpa funksjonen nederst som viser til "https://github.com/l3kn/org-fc" (dette er org flashcards) er jeg litt usikker hvorfor jeg har lagt inn, jeg kan ikke huske når denne kom til verden. Og reelt sett så skulle vel denne kommandoen kjøres kun en gang i det at man neppe trenger å laste ned org-flash hver gang man starter opp Emacs.
#+begin_src emacs-lisp :tangle "~/GitHub/emacs-config/pakker.el"
  (unless (package-installed-p 'quelpa)
    (with-temp-buffer
      (url-insert-file-contents "https://raw.githubusercontent.com/quelpa/quelpa/master/quelpa.el")
      (eval-buffer)
      (quelpa-self-upgrade)))
  ;; (quelpa '(discover-my-major :fetcher git :url "https://github.com/l3kn/org-fc"))
#+end_src
** Automatisk oppdatering
For periodisk, automatisk oppdatering av Emacs-pakker. Denne fant jeg i Dave Wilson sin youtube-snutt https://www.youtube.com/watch?v=dtjq68F2dXw&t=839s. 
#+begin_src emacs-lisp :tangle "~/GitHub/emacs-config/pakker.el"
  (use-package auto-package-update
    :defer t
    :custom
    (auto-package-update-interval 14)
    (auto-package-update-prompt-before-update t)
    (auto-package-update-hide-results t)
    :config
    (auto-package-update-maybe)
    (auto-package-update-at-time "09:00")
    )
#+end_src
* Generelt
En samling av ulik konfigurasjon knyttet til hvordan Emacs ser ut og hvordan Emacs generelt fungerer.
** Utseende
*** Meny
Jeg synes at menyer generelt sett i Emacs gir visuell støy. Og hva oppstartsbeskjeder angår så forstår jeg lite av disse. Derfor slår jeg av det meste. 
#+begin_src emacs-lisp :tangle "~/GitHub/emacs-config/generelt.el"
    (when window-system
      (tooltip-mode -1)
      (tool-bar-mode -1)
      (menu-bar-mode -1)
      (scroll-bar-mode -1))
  (setq inhibit-startup-message t)
  ;; (set-fringe-mode 0)
  (setq visible-bell t)
  (global-visual-line-mode t)
  (display-time-mode 1)
#+end_src
*** Maskinspesifik generell konfigurasjon
**** Basis font
#+begin_src emacs-lisp :tangle "~/GitHub/emacs-config/generelt.el"
  (cond ((eq system-type 'windows-nt) (set-frame-font "Consolas-14"))
        ((string= system-name "macebell") (set-frame-font "Liberation Mono-15"))
        ((string= system-name "kbell") (set-frame-font "Liberation Mono-11"))
        ((string= system-name "ingentingen") (set-frame-font "Liberation Mono-12")))
#+end_src
*** Doom modeline
#+begin_src emacs-lisp :tangle "~/GitHub/emacs-config/generelt.el"
  (use-package doom-modeline
    :ensure t
    :init (doom-modeline-mode 1)
    :config (setq doom-modeline-bar-height 25
                  doom-modeline-bar-width 3
                  doom-modeline-buffer-encoding t
                  doom-modeline-workspace-name t))
  ;; (use-package doom-themes
    ;; :init (load-theme 'doom-palenight t))
#+end_src
** Forskjellig
#+begin_src emacs-lisp :tangle "~/GitHub/emacs-config/generelt.el"
(put 'downcase-region 'disabled nil)
(set-language-environment "UTF-8")
#+end_src
** Tekstkontroll
*** Forkortelser
#+begin_src emacs-lisp :tangle "~/GitHub/emacs-config/generelt.el"
(setq abbrev-file-name "~/.emacs.d/abbrev_defs")
(setq save-abbrevs 'silent)
(setq-default abbrev-mode t)
#+end_src
*** Tekstmarkering
#+begin_src emacs-lisp :tangle "~/GitHub/emacs-config/generelt.el"
    (use-package hi-lock
      :defer t
      :bind (("M-o l" . highlight-lines-matching-regexp)
             ("M-o r" . highlight-regexp)
             ("M-o w" . highlight-phrase)))
#+end_src
** Visning av kommandoer
#+begin_src emacs-lisp :tangle "~/GitHub/emacs-config/generelt.el"
  (use-package command-log-mode
    :defer t
    :bind
    ("C-c <f10>" . clm/toggle-command-log-buffer)
    :config
    (global-command-log-mode t))
#+end_src
** Oppstart av Emacs
#+begin_src emacs-lisp :tangle "~/GitHub/emacs-config/generelt.el"
(emacs-init-time)
;; Use a hook so the message doesn't get clobbered by other messages.
(add-hook 'emacs-startup-hook
          (lambda ()
            (message "Emacs ready in %s with %d garbage collections."
                     (format "%.2f seconds"
                             (float-time
                              (time-subtract after-init-time before-init-time)))
                     gcs-done)))

(setq gc-cons-threshold (* 50 1000 1000))
#+end_src
** Legg til når Emacs laster
Denne filen har jeg lastet ned i fra GitHub og det er noe jeg trenger for å få org-babel til å kjøre programmeringsspråket Racket.
#+begin_src emacs-lisp :tangle "~/GitHub/emacs-config/generelt.el"
(add-to-list 'load-path "~/.emacs.d/ob-racket-master/")
#+end_src
* Fullføring
** Helm 
*** [[https://emacs-helm.github.io/helm/#introduction][Generelt]]
Pakke som lager et rammeverk for søking og innsnevring av valg og for det å fullføre navn på filer og kommandoer og så videre. 
#+begin_src emacs-lisp :tangle "~/GitHub/emacs-config/helm-konf.el"
  (use-package helm
    :ensure t
    :bind (
           ("M-x" . helm-M-x)
           ("C-x C-f" . helm-find-files)
           ("C-x f" . helm-recentf)
           ("M-y" . helm-show-kill-ring)
           ("C-x b" . helm-buffers-list)	;
           ("C-x c y" . helm-yas-complete)
           ("C-x c Y" . helm-yas-create-snippet-on-region)
           ("C-c h o" . helm-occur)
           ("C-c h x" . helm-register)
           ("C-c <f9>" . helm-calcul-expression)
           ("C-c <f1>" . helm-colors)
           ("M-p" . helm-previous-line)
           ("M-k" . helm-next-line)
           ("M-I" . helm-previous-page)
           ("M-K" . helm-next-page)
           ("M-h" . helm-beginning-of-buffer)
           ("M-H" . helm-end-of-buffer)
           )
    :init
    (setq helm-buffers-lazy-matching t
          helm-recentf-fuzzy-match t
          helm-locate-fuzzy-match t
          helm-split-window-in-side-p t
          helm-lisp-fuzzy-completion t
          helm-autoresize-max-height 0
          helm-autoresize-min-height 20)
    :config
    (ido-mode -1)
    (helm-mode 1)
    (helm-autoresize-mode 1))
  (when (eq system-type 'gnu/linux) (use-package helm-ls-git
                                      :after helm
                                      :bind (("C-x C-d" . helm-browse-project)
                                             ("C-x r p" . helm-projects-history))))
#+end_src
*** Swiper-Helm
#+begin_src emacs-lisp :tangle "~/GitHub/emacs-config/helm-konf.el"
(use-package swiper-helm
  :ensure t
  :bind ("C-s" . swiper-helm))
#+end_src
* Flermarkør
#+begin_src emacs-lisp :tangle "~/GitHub/emacs-config/flere-markører.el"
    (use-package multiple-cursors
      :defer t
      :bind
      (
       ("C-c m t" . mc/mark-all-like-this)
       ("C-c m l" . mc/edit-lines)
       ("C-c m e" . mc/edit-end-of-lines)
       ("C-c m a" . mc/edit-beginning-of-lines)
       ("C-c m n" . mc/edit-next-line-like-this)
       ("C-c m p" . mc/edit-previous-like-this)
       ("C-c m r" . set-rectangular-region-anchor)))
#+end_src
* Programmering
** Python
#+begin_src emacs-lisp :tangle "~/GitHub/emacs-config/programmering.el"
  ;; (setq python-shell-completion-native-enable nil) 
  (setq python-shell-interpreter "/home/bwarland/anaconda3/bin/python3")
#+end_src
** Racket
#+begin_src emacs-lisp :tangle "~/GitHub/emacs-config/programmering.el"
  (use-package racket-mode
    :defer t
    :config
    (when (eq system-type 'windows-nt) ((setq racket-racket-program "C:\\Program Files\\Racket\\racket.exe"
                                              racket-raco-program "C:\\Program Files\\Racket\\raco.exe"))))
(require 'ob-racket)
#+end_src

** SQLite
#+begin_src emacs-lisp :tangle "~/GitHub/emacs-config/programmering.el"
(setq sql-sqlite-program "/home/bwarland/anaconda3/bin/sqlite3")
#+end_src
* Org-mode
Alle moduler og pakker som har med org-mode å gjøre.

Alle Org-Mode-konfigureringers mor: [[http://doc.norang.ca/org-mode.html][Bernt Hansen sin konfigurasjonsfil]].
** generelt
#+begin_src emacs-lisp :tangle "~/GitHub/emacs-config/org-konf.el"
  (use-package org
    :mode (("\\.org$" . org-mode))
    :hook (org-mode . org-bullets-mode)
    :init
    (setq ;; UTSEENDE
            ;; ===================
     org-hide-leading-stars t
     org-startup-indented t
     org-startup-folded t
     initial-major-mode 'org-mode
     org-pretty-entities t
     org-pretty-entities-include-sub-superscripts nil
     org-use-fast-todo-selection t
     org-treat-s-cursor-todo-selection-as-state-change nil
     org-directory "~/GitHub"
     org-reverse-note-order nil
     org-refile-use-outline-path t 
     org-outline-path-complete-in-steps nil
     org-refile-allow-creating-parent-nodes (quote confirm)
     org-indirect-buffer-display 'current-window
     org-hide-emphasis-markers t
     org-tags-column -50
     org-hide-emphasis-marker t
     org-ellipsis " ..."
     org-archive-location "~/Documents/org-arkiv/arkiv.org::* TASK"
     org-todo-keywords (quote (
                               (sequence "TODO(t)" "NEXT(n)" "|" "DONE(d)")
                               (sequence "jour(j)" "fund(f)")))

     org-todo-keyword-faces (quote (("jour" :foreground "red" :background "white")
                                           ("fund" :foreground "blue" :background "white")
                                           ("TODO" :foreground "red" :background "white")
                                           ("NEXT" :foreground "blue" :background "white")
                                           ("DONE" :foreground "dark green" :background "white"))))
    :bind
    (("C-c o" . 'org-mode)
     ("C-c c" . 'org-capture)
     ("<f5>" . 'org-copy-subtree)
     ("C-c a" . 'org-agenda)
     ("C-c l" . 'org-store-link)
     ("C-c C-." . org-time-stamp)
     ("C-c C-t". 'org-todo)		;
     ("C-c t" . 'org-show-todo-tree)
     ("C-c C-w" . 'org-capture-refile)
     ("C-c C-k" . 'org-capture-kill))
    :config
    ;; (setq-default major-mode 'org-mode)
    )

#+end_src
