README.org
** startmappe
#+begin_src emacs-lisp :tangle "~/GitHub/emacs-config/org-konf.el"
(cond ((eq system-type 'windows-nt) (setq default-directory "~/C:Users/bjorwa/Documents/GitHub/"))
      ((eq system-type 'gnu/linux) (setq default-directory "~/GitHub/")))
#+end_src
** Agenda
*** Org-agenda
#+begin_src emacs-lisp
  (setq org-agenda-columns t
        org-agenda-tags-column -50
        org-agenda-include-deadlines t
        org-agenda-compact-blocks t
        org-agenda-block-seperator t
        org-agenda-span 5
        ;; AGENDA LOG
        org-agenda-start-with-log-mode t
        org-agenda-log-done 'note
        org-agenda-log-into-drawer t
        ;; TIME GRID
        org-agenda-use-time-grid t
        org-agenda-include-diary t
        org-agenda-skip-scheduled-if-done t
        org-agenda-skip-deadline-if-done t
        org-agenda-time-grid (quote ((daily today remove-match)
                                     (0600 0800 1000 1200 1400 1600)
                                     "      " "................")))
#+end_src
*** Org-Super-Agenda
#+begin_src emacs-lisp :tangle "~/GitHub/emacs-config/org-konf.el"
  (when (eq system-type 'gnu/linux) (require 'org-super-agenda))

  (when (eq system-type 'gnu/linux)
    (use-package org-super-agenda
      :ensure t
      :config
      (org-super-agenda-mode 1)
      (setq org-super-agenda-groups
            '((:name "TIDSPLAN"
                     :time-grid t
                     :todo "TODO")
              (:name "Informatikk" :tag "informatikk")
              (:name "Emacs" :tag "emacs")
              (:name "GitHub" :tag "git")
              (:name "Linux" :tag "linux")
              (:name "Racket/Scheme" :tag "scheme")
              (:name "Python" :tag "python")
              (:name "Jobb" 
                     :tag "power_bi"
                     :tag "excel")
              (:discard (:tag "ikke_kal"))))))
#+end_src
** Filer mye brukt i omarkivering
#+begin_src emacs-lisp :tangle "~/GitHub/emacs-config/org-konf.el"
    (let ((window-path "~/:C/Users/bjorwa/Documents/GitHub/Markedsanalyse/journaler/")
          (linux-path "~/GitHub/Markedsanalyse/journaler/"))
      (cond ((eq system-type 'windows-nt) (setq org-refile-targets (quote (((concat window-path "arkiv.org") :maxlevel . 2)
                                                                           ((concat window-path "liq.org") :maxlevel . 4)
                                                                           ((concat window-path "reg.org") :maxlevel . 4)
                                                                           ((concat window-path "master-energi.org.org") :maxlevel . 4)))))
            ((eq system-type 'gnu/linux) (setq org-refile-targets (quote (((concat linux-path "arkiv.org") :maxlevel . 2)
                                                                         ((concat linux-path "liq.org") :maxlevel . 4)
                                                                         ((concat linux-path "reg.org") :maxlevel . 4)
                                                                         ((concat linux-path "master-energi.org.org") :maxlevel . 4)))))))
  (advice-add 'org-refile :after 'org-save-all-org-buffers)
#+end_src
** Hydra
#+begin_src emacs-lisp :tangle "~/GitHub/emacs-config/org-konf.el"
(require 'org-fc-hydra)
#+end_src
** Maler
*** Fangstmaler
Jeg bruker mange av disse fangstmalene både i arbeid og privat da det er noe som hjelper meg å samle, fange og lagre informasjon raskt. Dette viser også konfigureringen, skjønt det kan bli noe graps i koden. 
#+begin_src emacs-lisp :tangle "~/GitHub/emacs-config/org-konf.el"
(cond ((eq system-type 'windows-nt)
       (setq org-capture-templates
       	     (quote (
       		     ("d" "drill/emner")
       		     ("db" "PowerBI" entry (file+olp "~/C:/Users/bjorwa/Documents/GitHub//GitHub/Notater/informatikk.org" "PowerBI")
       		      "** %? :drill:power_bi:\n:PROPERTIES:\n:DRILL_CARD_TYPE: twosided\n:end:\n# ")
       		     ("dd" "Database" entry (file+olp "~/C:/Users/bjorwa/Documents/GitHub//GitHub/Notater/informatikk.org" "Database")
       		      "** %? :drill:db:\n:PROPERTIES:\n:DRILL_CARD_TYPE: twosided\n:end:\n# ")
       		     ("de" "Emacs config" entry (file+olp "~/C:/Users/bjorwa/Documents/GitHub//GitHub/Notater/informatikk.org" "Emacs")
       		      "** %? :drill:emacs:\n:PROPERTIES:\n:DRILL_CARD_TYPE: twosided\n:end:\n# ")
		     ("dg" "GitHub" entry (file+olp "~/C:/Users/bjorwa/Documents/GitHub/Notater/informatikk.org" "Git")
		      "** %? :drill:git:\n:PROPERTIES:\n:DRILL_CARD_TYPE: twosided\n:end:\n# ")
       		     ("di" "Informatikk" entry (file+olp "~/C:/Users/bjorwa/Documents/GitHub//GitHub/Notater/informatikk.org" "Informatikk")
       		      "** %? :drill:informatikk:\n:PROPERTIES:\n:DRILL_CARD_TYPE: twosided\n:end:\n# ")
       		     ("dl" "Linux" entry (file+olp "~/C:/Users/bjorwa/Documents/GitHub//GitHub/Notater/informatikk.org" "Linux")
       		      "** %? :drill:linux:\n:PROPERTIES:\n:DRILL_CARD_TYPE: twosided\n:end:\n# ")
       		     ("dn" "Numpy" entry (file+olp "~/C:/Users/bjorwa/Documents/GitHub//GitHub/Notater/informatikk.org" "Numpy")
       		      "** %? :drill:python:\n:DRILL_CARD_TYPE: twosided\n:end:\n# ")
       		     ("do" "Office" entry (file+olp "~/C:/Users/bjorwa/Documents/GitHub//GitHub/Notater/informatikk.org" "Office")
       		      "** %? :drill:office:\n:PROPERTIES:\n:DRILL_CARD_TYPE: twosided\n:end:\n# ")
       		     ("dP" "Pandas" entry (file+olp "~/C:/Users/bjorwa/Documents/GitHub//GitHub/Notater/informatikk.org" "Pandas")
       		      "** %? :drill:python:\n:PROPERTIES:\n:DRILL_CARD_TYPE: twosided\n:end:\n# ")
       		     ("dp" "Python" entry (file+olp "~/C:/Users/bjorwa/Documents/GitHub//GitHub/Notater/informatikk.org" "Python")
       		      "** %? :drill:python:\n:PROPERTIES:\n:DRILL_CARD_TYPE: twosided\n:end:\n# ")
       		     ("dr" "Racket" entry (file+olp "~/C:/Users/bjorwa/Documents/GitHub//GitHub/Notater/informatikk.org" "Racket")
       		      "** %? :drill:scheme:\n:PROPERTIES:\n:DRILL_CARD_TYPE: twosided\n:end:\n# ")
       		     ("dx" "Excel" entry (file+olp "~/C:/Users/bjorwa/Documents/GitHub//GitHub/Notater/informatikk.org" "Racket")
       		      "** %? :drill:excel:\n:PROPERTIES:\n:DRILL_CARD_TYPE: twosided\n:end:\n# ")
		     ("f" "fortelling og retorikk")
		     ("ff" "fortelling" entry (file+olp "~C:/Users/bjorwa/Documents/GitHub/Notater/forret.org" "fortelling")
		      "* %?\n")
		     ("fr" "retorikk" entry (file+olp "~C:/Users/bjorwa/Documents/GitHub/Notater/forret.org" "retorikk")
		      "* %?\n")
       		     ("h" "handling/gjøremål")
       		     ("hg" "gjøremål" entry (file+olp "~/C:/Users/bjorwa/Documents/GitHub//GitHub/Notater/moeter.org" "gjøremål")
       		      "* TODO %?\n%^t")
       		     ("hm" "møter" entry (file+olp "~/C:/Users/bjorwa/Documents/GitHub//GitHub/Notater/moeter.org" "møter")
       		      "* %?\n%^t")
       		     ("j" "journal/føring")
       		     ("jd" "Dagbok" entry (file+datetree+prompt "~/C:/Users/bjorwa/Documents/GitHub//GitHub/Journal/dagbok.org")
       		      "* %?\n")
       		     ("jf" "Fundamentals" entry (file+datetree+prompt "~/C:/Users/bjorwa/Documents/GitHub//GitHub/Markedsanalyse/journaler/fundamentals.org")
       		      "* %?\nhjlink")
       		     ("jF" "Ferdigheter" entry (file+datetree+prompt "~/C:/Users/bjorwa/Documents/GitHub//GitHub/Notater/ferdigheter.org")
       		      "* %?\n")
       		     ("jj" "Journal" entry (file+datetree+prompt "~/C:/Users/bjorwa/Documents/GitHub//GitHub/Markedsanalyse/journaler/journal.org")
       		      "* %?\nhjlink")
		     ("jr" "Retorikk og kommunikasjon" entry (file+datetree+prompt "~/C:/Users/bjorwa/Documents/GitHub/Journal/retorikk.org")
       		      "* %?\n")
       		     ("jø" "Økonomi" entry (file+datetree+prompt "~/C:/Users/bjorwa/Documents/GitHub//GitHub/Notater/econ.org")
		      		     ("t" "tabell")
		     ("th" "handel" table-line (file+headline "~/notebook/markedsvurdering.org" "dagsrapport" "handel")
		      "|%^u|%^{type}|%^{selger}|%^{kjøper}|%^{periode}|%^{incoterm}|%^{pris}|%^{kilde}|%^{kommentar}|")
       		      "* %?\n"))))
       )
      ((eq system-type 'gnu/linux)
       (setq org-capture-templates
       	     (quote (
       		     ("d" "drill")
       		     ("db" "PowerBI" entry (file+olp "~/GitHub/Notater/informatikk.org" "PowerBI")
       		      "** %? :drill:power_bi:\n:PROPERTIES:\n:DRILL_CARD_TYPE: twosided\n:end:\n# ")
       		     ("dd" "Database" entry (file+olp "~/GitHub/Notater/informatikk.org" "Database")
       		      "** %? :drill:db:\n:PROPERTIES:\n:DRILL_CARD_TYPE: twosided\n:end:\n# ")
       		     ("de" "Emacs config" entry (file+olp "~/GitHub/Notater/informatikk.org" "Emacs")
       		      "** %? :drill:emacs:\n:PROPERTIES:\n:DRILL_CARD_TYPE: twosided\n:end:\n# ")
		     ("dg" "GitHub" entry (file+olp "~/GitHub/Notater/informatikk.org" "Git")
		      "** %? :drill:git:\n:PROPERTIES:\n:DRILL_CARD_TYPE: twosided\n:end:\n# ")
       		     ("di" "Informatikk" entry (file+olp "~/GitHub/Notater/informatikk.org" "Informatikk")
       		      "** %? :drill:informatikk:\n:PROPERTIES:\n:DRILL_CARD_TYPE: twosided\n:end:\n# ")
       		     ("dl" "Linux" entry (file+olp "~/GitHub/Notater/informatikk.org" "Linux")
       		      "** %? :drill:linux:\n:PROPERTIES:\n:DRILL_CARD_TYPE: twosided\n:end:\n# ")
       		     ("dn" "Numpy" entry (file+olp "~/GitHub/Notater/informatikk.org" "Numpy")
       		      "** %? :drill:python:\n:DRILL_CARD_TYPE: twosided\n:end:\n# ")
       		     ("do" "Office" entry (file+olp "~/GitHub/Notater/informatikk.org" "Office")
       		      "** %? :drill:office:\n:PROPERTIES:\n:DRILL_CARD_TYPE: twosided\n:end:\n# ")
       		     ("dP" "Pandas" entry (file+olp "~/GitHub/Notater/informatikk.org" "Pandas")
       		      "** %? :drill:python:\n:PROPERTIES:\n:DRILL_CARD_TYPE: twosided\n:end:\n# ")
       		     ("dp" "Python" entry (file+olp "~/GitHub/Notater/informatikk.org" "Python")
       		      "** %? :drill:python:\n:PROPERTIES:\n:DRILL_CARD_TYPE: twosided\n:end:\n# ")
       		     ("dr" "Racket" entry (file+olp "~/GitHub/Notater/informatikk.org" "Racket")
       		      "** %? :drill:scheme:\n:PROPERTIES:\n:DRILL_CARD_TYPE: twosided\n:end:\n# ")
		     ("ds" "Samfunn" entry (file+olp "~/GitHub/Notater/samfunndrill.org" "begreper")
       		      "** %? :drill:samfunn:\n:PROPERTIES:\n:DRILL_CARD_TYPE: twosided\n:end:\n# ")
       		     ("dx" "Excel" entry (file+olp "~/GitHub/Notater/informatikk.org" "Racket")
       		      "** %? :drill:excel:\n:PROPERTIES:\n:DRILL_CARD_TYPE: twosided\n:end:\n# ")
		     ("f" "fortelling")
		     ("ff" "fortelling" entry (file+olp "~/GitHub/Notater/forret.org" "fortelling")
		      "* %?\n")
		     ("fr" "retorikk" entry (file+olp "~/GitHub/Notater/forret.org" "retorikk")
		      "* %?\n")
       		     ("h" "handling")
       		     ("hg" "gjøremål" entry (file+olp "~/GitHub/Notater/moeter.org" "gjøremål")
       		      "* TODO %?\n%^t")
       		     ("hm" "møter" entry (file+olp "~/GitHub/Notater/moeter.org" "møter")
       		      "* %?\n%^t")
       		     ("j" "journal")
       		     ("jd" "Dagbok" entry (file+datetree+prompt "~/GitHub/Journal/dagbok.org")
       		      "* %?\n")
       		     ("jf" "Fundamentals" entry (file+datetree+prompt "~/GitHub/Markedsanalyse/journaler/fundamentals.org")
       		      "* %?\nhjlink")
       		     ("jF" "Ferdigheter" entry (file+datetree+prompt "~/GitHub/Notater/ferdigheter.org")
       		      "* %?\n")
       		     ("jj" "Journal" entry (file+datetree+prompt "~/GitHub/Markedsanalyse/journaler/journal.org")
       		      "* %?\nhjlink")
		     ("jr" "Retorikk" entry (file+datetree+prompt "~/GitHub/Journal/retorikk.org")
       		      "* %?\n")
		     ("js" "Samfunn" entry (file+datetree+prompt "~/GitHub/Journal/samfunn.org")
       		      "* %?\n")
		     ("jt" "Trening" entry (file+datetree+prompt "~/GitHub/Journal/trening.org")
		      "* %?\n")
       		     ("jø" "Økonomi" entry (file+datetree+prompt "~/GitHub/Journal/econ.org") 
       		      "* %?\n")
		     ("t" "tabell")
		     ("tt" "trening" table-line (file+headline "~/GitHub/Journal/trening.org" "Tabell")
		      "|%^u|%^{type}|%^{oppvarming}|%^{runder}|%^{vekt}|%^{tid}|%^{kommentar}|")
		     )))))
#+end_src
*** Strukturmal
F.eks <pyt + TAB vil eksandere til Python med tangle.
#+begin_src emacs-lisp :tangle "~/GitHub/emacs-config/org-konf.el"
  (require 'org-tempo)
  (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
  (add-to-list 'org-structure-template-alist '("elt" . "src emacs-lisp :tangle"))
  (add-to-list 'org-structure-template-alist '("py" . "src python"))
  (add-to-list 'org-structure-template-alist '("pyt" . "src python :tangle"))
  (add-to-list 'org-structure-template-alist '("sr" . "src racket"))
  (add-to-list 'org-structure-template-alist '("srt" . "src racket :tangle"))
#+end_src
** Terping
En strukturert terping av viktig informasjon, metoder og teknikker er viktig for meg da jeg har en teflonhjerne som ikke raskt absorberer. Dette tror jeg er en pakke som ikke jevnlig oppdateres, om i det hele tatt. Og her har jeg hatt litt problemer med en feilmelding og kluss med kode som jeg på et vil klarte å kontrollere ved å blokke ut noe av koden i modulens el-fil (laster denne inn i stedet for elc-filen, [[file:Notater/ferdigheter.org::*Feil under Emacs-konfigurering][beskrivelse i filen ferdigheter.org]]).
#+begin_src emacs-lisp :tangle "~/GitHub/emacs-config/org-konf.el"
  (require 'org-drill)

  (use-package org-drill
    :ensure t
    ;; https://gitlab.com/phillord/org-drill/
    :config
    (setq org-drill-maximum-duration 20
          org-drill-spaced-repetition-algorithm 'sm2
          org-drill-add-random-noise-to-intervals-p t
          org-drill-adjust-intervals-for-early-and-late-repetitions-p t))
#+end_src
** Org-babe for "literate programming"
#+begin_src emacs-lisp :tangle "~/GitHub/emacs-config/org-konf.el"
  (org-babel-do-load-languages
   'org-babel-load-languages (quote ((emacs-lisp . t)
                                     (racket . t)
                                     (sqlite . t)
                                     (python . t))))
#+end_src
* Maler
** Yasnippet
#+begin_src emacs-lisp :tangle "~/GitHub/emacs-config/maler.el"
  (use-package yasnippet
    :ensure t
    :diminish yas-minor-mode
    :init (yas-global-mode)
    :config
    (yas-global-mode)
    (add-hook 'hippie-expand-try-functions-list 'yas-hippie-try-expand)
    (setq yas-key-syntaxes '("w_" "w_." "^ "))
  ;;    (setq yas-installed-snippets-dir "~/elisp/yasnippet-snippets")
    (setq yas-expand-only-for-last-commands nil)
    (yas-global-mode 1)
    (bind-key "\t" 'hippie-expand yas-minor-mode-map)
    (add-to-list 'yas-prompt-functions 'shk-yas/helm-prompt)
    (global-set-key (kbd "C-c y") (lambda () (interactive)
                                    (yas/load-directory "~/elisp/snippets"))))
#+end_src

* Register
