README.org
** Linux
#+begin_src emacs-lisp :tangle "~/GitHub/emacs-config/linreg.el"
  (set-register ?d '(file . "~/GitHub/Journal/dagbok.org"))
  (set-register ?t '(file . "~/GitHub/Journal/trening.org"))
  (set-register ?c '(file . "~/GitHub/emacs-config/custom.el"))
  (set-register ?g '(file . "~/GitHub/"))
  (set-register ?c '(file . "~/GitHub/Notater/ferdigheter.org"))
  (set-register ?k '(file . "~/GitHub/emacs-config/README.org"))
  (set-register ?i '(file . "~/GitHub/Notater/informatikk.org"))
  (set-register ?j '(file . "~/GitHub/Markedsanalyse/journaler/journal.org")))
  (set-register ?l '(file . "~/GitHub/Markedsanalyse/journaler/liq.org")))
  (set-register ?r '(file . "~/GitHub/Markedsanalyse/journaler/reg.org")))
  (set-register ?e '(file . "~/.emacs")))
#+end_src
** windows
#+begin_src emacs-lisp :tangle "~/GitHub/emacs-config/winreg.el"
  (set-register ?c '(file . "~C:\\Users\\bjorwa\\Documents\\GitHub\\emacs-config\\custom.el"))
  (set-register ?g '(file . "~C:\\Users\\bjorwa\\Documents\\GitHub\\"))
  (set-register ?c '(file . "~C:\\Users\\bjorwa\\Documents\\GitHub\\Notater\\ferdigheter.org"))
  (set-register ?k '(file . "~C:\\Users\\bjorwa\\Documents\\GitHub\\emacs-config\\README.org"))
  (set-register ?i '(file . "~C:\\Users\\bjorwa\\Documents\\GitHub\\Notater\\informatikk.org"))
  (set-register ?j '(file . "~C:\\Users\\bjorwa\\Documents\\GitHub\\Markedsanalyse\\journaler\\informatikk.org"))
  (set-register ?l '(file . "~C:\\Users\\bjorwa\\Documents\\GitHub\\Markedsanalyse\\journaler\\liq.org"))
  (set-register ?r '(file . "~C:\\Users\\bjorwa\\Documents\\GitHub\\Markedsanalyse\\journaler\\reg.org"))
  (set-register ?e '(file . "~C:\\Users\\bjorwa\\AppData\\Roaming\\.emacs"))
#+end_src
* Kommandoer og tastebinding
Samling av kommandoer og tastebindinger som ikke nødvendigvis knyttes mot en Emacs-pakke.
#+begin_src emacs-lisp :tangle "~/GitHub/emacs-config/gkb.el"
(global-set-key (kbd "\C-x\C-k") 'kill-region)
(global-set-key (kbd "\C-c\C-k") 'kill-region)

(global-set-key (kbd "C-<up>") 'text-scale-increase)
(global-set-key (kbd "C-<down>") 'text-scale-decrease)
(global-set-key (kbd "C-<wheel-up>") 'text-scale-increase)
(global-set-key (kbd "C-<wheel-down>") 'text-scale-decrease)

(global-set-key (kbd "C-c r") 'comment-region)
(global-set-key (kbd "C-c u") 'uncomment-region)

(global-set-key (kbd "C-x a") 'define-global-abbrev)

(global-set-key (kbd "C-c l") 'org-store-link)

(global-set-key (kbd "C-x C-<up>") 'windmove-up)
(global-set-key (kbd "C-x C-<down>") 'windmove-down)
(global-set-key (kbd "C-x C-<left>") 'windmove-left)
(global-set-key (kbd "C-x C-<right>") 'windmove-right)

(global-set-key (kbd "\M-?") 'help-command)
(global-set-key (kbd "<f1>") 'enlarge-window)
(global-set-key (kbd "<f2>") 'shrink-window)
(global-set-key (kbd "<f3>") 'shrink-window-horizontally)
(global-set-key (kbd "<f4>") 'enlarge-window-horizontally)
;; (global-set-key (kbd "<f5>") 'org-copy-subtree) ;; i custom.el
(global-set-key (kbd "<f9>") 'calc)
(global-set-key (kbd "<f11>") 'describe-function)
(global-set-key (kbd "<f12>") '(lambda ()
				 (interactive)
				 (popup-menu 'yank-menu)))
(global-set-key (kbd "\M-?") 'help-command)
#+end_src

