winreg.el
(set-register ?c '(file . "~C:\\Users\\bjorwa\\Documents\\GitHub\\emacs-config\\custom.el"))
(set-register ?g '(file . "~C:\\Users\\bjorwa\\Documents\\GitHub\\"))
(set-register ?c '(file . "~C:\\Users\\bjorwa\\Documents\\GitHub\\Notater\\ferdigheter.org"))
(set-register ?k '(file . "~C:\\Users\\bjorwa\\Documents\\GitHub\\emacs-config\\README.org"))
(set-register ?i '(file . "~C:\\Users\\bjorwa\\Documents\\GitHub\\Notater\\informatikk.org"))
(set-register ?j '(file . "~C:\\Users\\bjorwa\\Documents\\GitHub\\Markedsanalyse\\journaler\\informatikk.org"))
(set-register ?l '(file . "~C:\\Users\\bjorwa\\Documents\\GitHub\\Markedsanalyse\\journaler\\liq.org"))
(set-register ?r '(file . "~C:\\Users\\bjorwa\\Documents\\GitHub\\Markedsanalyse\\journaler\\reg.org"))
(set-register ?e '(file . "~C:\\Users\\bjorwa\\AppData\\Roaming\\.emacs"))
